//Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
//[345, 897, 568, 234] -> 2

// -------------------МЕТОДЫ----------------------------------------------------------------------------
// -------------------МЕТОДЫ ВЗЯТЫЕ ИЗ ПРЕДЫДУЩИХ ЗАДАНИЙ----------------------------------------------------------------------------
int InputNumber(string qwerStr)//проверяет "численность"."Не выпускает" без ввода ЧИСЛА
    {int num;
    string? text;
    while(true)
        {
            Console.WriteLine(qwerStr);
            text=Console.ReadLine();
           if(int.TryParse(text,out num)) break;
           Console.WriteLine("Введено некорректное значение.Попробуйте еще раз"); 
        }
    return num;  
    }
//------------------------------------------------------------------------------------------------------
int InputNumberWithFilter(string qwerStr, bool zeroEnable, bool negativEnable)//Пропускает положительные. 0 и отрицательные пропускает в соответствии со булевыми значениями zeroEnable,negativEnable
    {int num;
    while(true)
        {
            num=InputNumber(qwerStr);//проверяет "численность"."Не выпускает" без ввода ЧИСЛА
           if(num>0 || num==0 && zeroEnable || num<0 && negativEnable) break;
           Console.WriteLine("Введено не разрешенное значение.Попробуйте еще раз"); 
        }
    return num;  
    }
// -------------------МЕТОДЫ НАПИСАННЫЕ ДЛЯ ТЕКУЩЕГО ЗАДАНИЯ----------------------------------------------------------------------------
void PrnArray(int[] array) // ВЫВОД МАССИВА НА ПЕЧАТЬ
    {
    System.Console.WriteLine("[ "+String.Join(", ",array)+"]");
    }
//------------------------------------------------------------------------------------------------------
void RandomsArray(int[] array, int min, int max) // МАССИВ - ЗАПОЛНЕНИЕ СЛУЧАЙНЫМИ ЧИСЛАМИ. MAX - МАКСИМАЛЬНО ДОПУСТИМОЕ ЧИСЛО
    {
    Random rnd = new Random();
    for (int i=0;i<array.Length;i++)  { array[i] = rnd.Next(min,max+1);} 
    }
//------------------------------------------------------------------------------------------------------
int CountEvenNumbersInArray(int[] array) //Количество четных чисел в массиве
    {
    int count =0;
    for (int i=0; i<array.Length; i++)
        {
            if (array[i]%2==0) {count++;}
        }
    return count;
    }
//------------------------------------------------------------------------------------------------------
// -------------------ОСНОВНАЯ ПРОГРАММА----------------------------------------------------------------------------

int size=InputNumberWithFilter("Введите размер массива :",false,false);
int [] ar =new int[size];
RandomsArray(ar,100,999);
PrnArray(ar);
int countEven=CountEvenNumbersInArray(ar);
Console.WriteLine ("Количество четных чисел в массиве: "+countEven);
